{
  "site": {
    "title": "Johnny Leo",
    "email": "info@johnnyleo.com"
  },
  "navigation": {
    "journal": "JOURNAL",
    "pieces": "PIECES",
    "series": "SERIES",
    "artist": "ARTIST",
    "inquiry": "INQUIRY"
  },
  "pieces": [
    {
      "id": "morning-light",
      "title": "Morning Light",
      "titleCh": "晨曦之間",
      "year": "2024",
      "medium": "Oil on Canvas",
      "size": "120 × 90 cm",
      "concept": "This piece explores the quiet moments of dawn, when light first breaks through darkness. The interplay of warm and cool tones represents the delicate balance between night and day, capturing the essence of transformation and renewal.",
      "image": "images/pieces/morning-light.jpg"
    },
    {
      "id": "urban-voice",
      "title": "Urban Voice",
      "titleCh": "城市之聲",
      "year": "2024",
      "medium": "Acrylic",
      "size": "150 × 100 cm",
      "concept": "An exploration of the rhythm and energy of metropolitan life. The dynamic composition reflects the constant movement, noise, and vitality that defines modern urban existence.",
      "image": "images/pieces/urban-voice.jpg"
    },
    {
      "id": "silent-forest",
      "title": "Silent Forest",
      "titleCh": "靜默森林",
      "year": "2023",
      "medium": "Mixed Media",
      "size": "100 × 100 cm",
      "concept": "A meditation on nature's quietude and the healing power of natural spaces. The layered textures evoke the depth and mystery of ancient woodlands.",
      "image": "images/pieces/silent-forest.jpg"
    },
    {
      "id": "traces-of-time",
      "title": "Traces of Time",
      "titleCh": "時間的痕跡",
      "year": "2023",
      "medium": "Oil on Canvas",
      "size": "130 × 95 cm",
      "concept": "Time leaves its mark on everything it touches. This work examines the visible and invisible ways that temporal passage shapes our world and ourselves.",
      "image": "images/pieces/traces-of-time.jpg"
    },
    {
      "id": "metropolitan-rhythm",
      "title": "Metropolitan Rhythm",
      "titleCh": "都會律動",
      "year": "2024",
      "medium": "Acrylic",
      "size": "140 × 110 cm",
      "concept": "The pulse of city life captured through bold gestures and vibrant color. Each stroke represents the collective heartbeat of millions moving through shared spaces.",
      "image": "images/pieces/metropolitan-rhythm.jpg"
    },
    {
      "id": "light-and-shadow",
      "title": "Light and Shadow",
      "titleCh": "光影交織",
      "year": "2023",
      "medium": "Mixed Media",
      "size": "110 × 85 cm",
      "concept": "An investigation into the eternal dance between illumination and darkness. The composition plays with contrast to reveal how each defines and enhances the other.",
      "image": "images/pieces/light-and-shadow.jpg"
    }
  ],
  "series": [
    {
      "id": "the-dreaming-fable",
      "title": "The Dreaming Fable",
      "titleCh": "童話囈語",
      "count": 7,
      "coverImage": "images/series/the-dreaming-fable/cover.jpg",
      "artworks": [
        {
          "title": "Dream No.1",
          "titleCh": "夢境 No.1",
          "size": "120 × 90 cm",
          "medium": "Oil on Canvas",
          "year": "2023",
          "concept": "This piece explores the mystical realm where fairy tales and reality intertwine, creating a dreamlike narrative that speaks to the child within us all.",
          "image": "images/series/the-dreaming-fable/dream-01.jpg"
        },
        {
          "title": "Dream No.2",
          "titleCh": "夢境 No.2",
          "size": "100 × 80 cm",
          "medium": "Acrylic",
          "year": "2023",
          "concept": "Continuing the exploration of fantastical narratives, this work delves deeper into the subconscious imagery of childhood wonder.",
          "image": "images/series/the-dreaming-fable/dream-02.jpg"
        }
      ]
    },
    {
      "id": "animals-soliloquy",
      "title": "Animals' Soliloquy",
      "titleCh": "動物的獨白",
      "count": 22,
      "coverImage": "images/series/animals-soliloquy/cover.jpg",
      "artworks": [
        {
          "title": "Silent Gaze",
          "titleCh": "沉默的凝視",
          "size": "150 × 120 cm",
          "medium": "Oil on Canvas",
          "year": "2024",
          "concept": "Through the eyes of animals, this work conveys their observations and reflections on the human world, challenging anthropocentric perspectives.",
          "image": "images/series/animals-soliloquy/silent-gaze.jpg"
        }
      ]
    },
    {
      "id": "pets-vs-pets",
      "title": "Pets vs Pets",
      "titleCh": "寵物 vs 寵物",
      "count": 14,
      "coverImage": "images/series/pets-vs-pets/cover.jpg",
      "artworks": [
        {
          "title": "Encounter",
          "titleCh": "相遇",
          "size": "130 × 100 cm",
          "medium": "Mixed Media",
          "year": "2024",
          "concept": "Exploring the interactions and relationships between different pets, revealing their unique personalities and the subtle social dynamics between them.",
          "image": "images/series/pets-vs-pets/encounter.jpg"
        }
      ]
    },
    {
      "id": "joyful-town",
      "title": "Joyful Town",
      "titleCh": "快樂町",
      "count": 9,
      "coverImage": "images/series/joyful-town/cover.jpg",
      "artworks": [
        {
          "title": "Street Corner Laughter",
          "titleCh": "街角的笑聲",
          "size": "140 × 110 cm",
          "medium": "Acrylic",
          "year": "2023",
          "concept": "Depicting an idealized community where people live in harmony, filled with joy and warmth. The work uses bright colors and light brushstrokes to create a utopian atmosphere.",
          "image": "images/series/joyful-town/street-corner.jpg"
        }
      ]
    },
    {
      "id": "the-invisible-citizens",
      "title": "The Invisible Citizens",
      "titleCh": "被城市遺忘的人",
      "count": 10,
      "coverImage": "images/series/the-invisible-citizens/cover.jpg",
      "artworks": [
        {
          "title": "Corner Silhouette",
          "titleCh": "角落的身影",
          "size": "160 × 120 cm",
          "medium": "Oil on Canvas",
          "year": "2024",
          "concept": "Focusing on marginalized groups in urban settings. Through somber tones and blurred outlines, the work expresses their loneliness and helplessness in the bustling city, evoking empathy and social awareness.",
          "image": "images/series/the-invisible-citizens/corner-silhouette.jpg"
        }
      ]
    },
    {
      "id": "the-weight-of-existence",
      "title": "The Weight of Existence",
      "titleCh": "生命重量之承載",
      "count": 5,
      "coverImage": "images/series/the-weight-of-existence/cover.jpg",
      "artworks": [
        {
          "title": "Carrying Forward",
          "titleCh": "負重前行",
          "size": "180 × 140 cm",
          "medium": "Oil on Canvas",
          "year": "2023",
          "concept": "Exploring the unbearable weight of life. Through heavy brushstrokes and layered colors, the work depicts people's resilience and struggle when facing life's pressures, while also conveying hope and strength.",
          "image": "images/series/the-weight-of-existence/carrying-forward.jpg"
        }
      ]
    }
  ],
  "journal": [
    {
      "id": "paris-art-fair-2026",
      "date": "2026.01.15",
      "title": "Upcoming Exhibition at Paris International Art Fair",
      "excerpt": "Johnny Leo will participate in the Paris International Art Fair in March, showcasing a new series exploring themes of time and memory through contemporary visual narratives.",
      "image": "images/journal/paris-fair.jpg",
      "content": "<p>We are thrilled to announce that Johnny Leo will be participating in the prestigious Paris International Art Fair this March. This marks a significant milestone in the artist's international career, bringing his unique contemporary vision to one of Europe's most renowned art events.</p><p>The exhibition will feature a brand new series that explores the intricate relationship between time and memory. Through a carefully curated selection of works, visitors will experience how Leo's distinctive visual language captures the ephemeral nature of human experience and the persistence of memory in contemporary society.</p><h2>Exhibition Details</h2><p>The fair will take place at the Grand Palais Éphémère from March 15-19, 2026. Johnny Leo's works will be showcased in Hall 3, Stand A42, presented in collaboration with Gallery X.</p><p>This new series represents a significant evolution in Leo's artistic practice, incorporating mixed media techniques and innovative approaches to traditional painting. Each piece in the series invites viewers to contemplate their own relationship with time and the ways in which memories shape our present reality.</p>"
    },
    {
      "id": "artist-of-the-year-2025",
      "date": "2025.12.20",
      "title": "Selected as Artist of the Year",
      "excerpt": "Honored to be selected as one of the most influential contemporary artists of 2025 by Asian Art Magazine, recognizing outstanding contributions to the field of contemporary art.",
      "image": "images/journal/artist-year.jpg",
      "content": "<p>Johnny Leo has been named one of the most influential contemporary artists of 2025 by Asian Art Magazine, a prestigious recognition that celebrates outstanding contributions to the field of contemporary art.</p><p>The selection committee praised Leo's innovative approach to traditional techniques and his ability to bridge Eastern and Western artistic traditions. His work has been noted for its profound emotional depth and its capacity to speak to universal human experiences while maintaining a distinctive cultural perspective.</p><h2>Recognition and Impact</h2><p>This honor comes after a year of significant achievements, including solo exhibitions in major cities and the completion of several important commissioned works. The award particularly recognizes Leo's commitment to pushing the boundaries of contemporary art while maintaining accessibility and emotional resonance with diverse audiences.</p><p>In his acceptance statement, Leo expressed gratitude to his supporters and emphasized his commitment to continuing to explore new artistic territories while staying true to his core vision of art as a medium for human connection and understanding.</p>"
    },
    {
      "id": "taipei-exhibition-2025",
      "date": "2025.11.08",
      "title": "Taipei Solo Exhibition Successfully Concluded",
      "excerpt": "The one-month solo exhibition at Taipei Museum of Contemporary Art was a great success, attracting over 10,000 art enthusiasts and collectors from around the region.",
      "image": "images/journal/taipei-exhibition.jpg",
      "content": "<p>Johnny Leo's highly anticipated solo exhibition at the Taipei Museum of Contemporary Art concluded this week after a successful one-month run. The exhibition attracted over 10,000 visitors from across Taiwan and the broader Asian region, establishing new attendance records for the museum's contemporary art programming.</p><p>Titled 'Echoes of Silence,' the exhibition featured over 40 works spanning the past five years of Leo's artistic practice. The carefully curated selection showcased the artist's evolution and his consistent exploration of themes related to urban life, human connection, and the search for meaning in contemporary society.</p><h2>Critical and Public Reception</h2><p>The exhibition received widespread critical acclaim, with reviewers praising the cohesive narrative and the emotional impact of the installed works. Local media highlighted the exhibition as one of the year's most important cultural events, noting Leo's ability to create work that resonates deeply with both art world insiders and general audiences.</p><p>Several pieces from the exhibition have been acquired by major collectors and institutions, further cementing Leo's position as one of the leading voices in contemporary Asian art. The museum has indicated interest in organizing a touring version of the exhibition to reach broader audiences across the region.</p>"
    },
    {
      "id": "urban-dialogues-2026",
      "date": "2025.10.12",
      "title": "New Series Coming Spring 2026",
      "excerpt": "After a year of creation, a new series titled 'Urban Dialogues' will be unveiled in spring 2026, presenting the artist's profound observations of modern urban life.",
      "image": "images/journal/new-series.jpg",
      "content": "<p>After a year of intensive creative work, Johnny Leo is preparing to unveil his new series titled 'Urban Dialogues' in spring 2026. This ambitious body of work represents the artist's most comprehensive exploration of modern urban life to date.</p><p>The series emerged from Leo's year-long observation and documentation of urban spaces across multiple cities. Through his distinctive visual language, he captures the complex interplay between individuals and their urban environments, exploring themes of connection, isolation, movement, and stillness within the contemporary metropolis.</p><h2>Artistic Evolution</h2><p>'Urban Dialogues' marks a significant evolution in Leo's artistic practice. While maintaining his characteristic attention to emotional depth and human experience, the new works incorporate innovative techniques and a broader color palette. The series experiments with scale and composition in ways that create immersive viewing experiences, inviting audiences to step into the urban landscapes Leo has created.</p><p>The official unveiling is scheduled for March 2026, with venues and dates to be announced in the coming months. Art institutions and galleries across Asia and Europe have already expressed strong interest in hosting exhibitions from this highly anticipated series.</p>"
    }
  ]
}
